# Loan Data Analysis

- A loan status data set will be loaded and analyzed. 
- Data Dictionary
    - Id: loan Id
    - Married: marital status of the debtor
    - Dependent: the number of people who claim the debtor as dependent
    - Education: the debtor has a college degree or not
    - SelfEmployed: the debtor is self-employed or not
    - Income: the debtor's monthly income
    - Loan: the balance of the loan in thousand dollars
    - Status: Y - the debtor is repaying the loan; N - the debtor is not repaying the loan
- Follow the *TODO* instruction to answer each question with a Python code snippet. After you finish answering all the questions, save the notebook with the necessary output for each code cell and then upload the notebook to Blackboard.

In [1]:
# initialization and data loading
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
frame = pd.read_csv(r'https://raw.githubusercontent.com/postmda/MDA610/master/Pages/LoanStatus.csv')

**TODO 1**
`frame` is the DataFrame that contains the loan status data. Find the number of rows in the DataFrame.

In [3]:
#####TODO 1#####
pass
np.size(frame,0)

614

**TODO 2** 
Show the first eight rows of the DataFrame.

In [28]:
#####TODO 2#####
pass
frame[:8]

,Id,Married,Dependents,Education,SelfEmployed,Income,Loan,Status
568,LP002840,No,0.0,Graduate,No,2378,9,N
551,LP002784,Yes,1.0,Not Graduate,No,2492,15,Y
14,LP001030,Yes,2.0,Graduate,No,1299,17,Y
94,LP001325,No,0.0,Not Graduate,No,3620,25,Y
133,LP001482,Yes,0.0,Graduate,Yes,3459,25,Y
555,LP002792,Yes,1.0,Graduate,No,5468,26,Y
147,LP001518,Yes,1.0,Graduate,No,1538,30,Y
270,LP001888,No,0.0,Graduate,No,3237,30,Y

**TODO 3**
Find the mean loan balance in thousand dollars.

In [5]:
#####TODO 3#####
pass
np.mean(frame,axis=1)

0      1977.333333
1      1570.666667
2      1022.000000
3       901.000000
4      2047.000000
5      1895.333333
6       809.333333
7      1066.333333
8      1392.000000
9      4397.000000
10     1090.666667
11      870.333333
12     1091.666667
13      655.666667
14      439.333333
15     1691.666667
16     1232.333333
17     1195.333333
18     1673.333333
19      905.000000
20     2588.000000
21     2090.333333
22      905.333333
23     1159.666667
24     1289.666667
25     3250.333333
26      973.666667
27     1446.000000
28      492.333333
29     1290.666667
          ...
584     978.000000
585    1485.333333
586     800.333333
587     745.000000
588    1614.666667
589     944.666667
590    1018.666667
591    2069.000000
592    3217.333333
593    1333.666667
594    5460.000000
595    1314.333333
596    2190.666667
597    1025.666667
598    3381.000000
599    1991.333333
600     256.666667
601    1016.333333
602    1944.666667
603    1282.666667
604    4165.666667
605     828.000000
606    1191.333333
607    1382.000000
608    1113.333333
609     990.333333
610    1383.000000
611    2775.333333
612    2590.666667
613    1572.000000
Length: 614, dtype: float64

**TODO 4**
Find the number of loans with a balance of at least 200 thousand dollars.

In [41]:
#####TODO 4#####
pass
frame['Loan'].where(frame['Loan'] > 200000)

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    NaN
13    NaN
14    NaN
15    NaN
16    NaN
17    NaN
18    NaN
19    NaN
20    NaN
21    NaN
22    NaN
23    NaN
24    NaN
25    NaN
26    NaN
27    NaN
28    NaN
29    NaN
       ..
584   NaN
585   NaN
586   NaN
587   NaN
588   NaN
589   NaN
590   NaN
591   NaN
592   NaN
593   NaN
594   NaN
595   NaN
596   NaN
597   NaN
598   NaN
599   NaN
600   NaN
601   NaN
602   NaN
603   NaN
604   NaN
605   NaN
606   NaN
607   NaN
608   NaN
609   NaN
610   NaN
611   NaN
612   NaN
613   NaN
Name: Loan, Length: 614, dtype: float64

**TODO 5** 
Sort the DataFrame in ascending order of column `Loan`. Show the last four rows in the sorted DataFrame.

In [24]:
#####TODO 5#####
pass
frame.sort_values("Loan", axis = 0, ascending = True, 
                 inplace = True, na_position ='last') 
frame[-4:]

           Id Married  Dependents Education SelfEmployed  Income  Loan Status
155  LP001536     Yes         4.0  Graduate           No   39999   600      Y
561  LP002813     Yes         1.0  Graduate          Yes   19484   600      Y
130  LP001469      No         0.0  Graduate          Yes   20166   650      Y
171  LP001585     Yes         3.0  Graduate           No   51763   700      Y

**TODO 6**
Find the number of debtors who are married and have a monthly income below 3000 dollars.

In [49]:
#####TODO 6#####
pass
frame['Married'].where(frame['Married'] ==True,)

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
8      NaN
9      NaN
10     NaN
11     NaN
12     NaN
13     NaN
14     NaN
15     NaN
16     NaN
17     NaN
18     NaN
19     NaN
20     NaN
21     NaN
22     NaN
23     NaN
24     NaN
25     NaN
26     NaN
27     NaN
28     NaN
29     NaN
      ...
584    NaN
585    NaN
586    NaN
587    NaN
588    NaN
589    NaN
590    NaN
591    NaN
592    NaN
593    NaN
594    NaN
595    NaN
596    NaN
597    NaN
598    NaN
599    NaN
600    NaN
601    NaN
602    NaN
603    NaN
604    NaN
605    NaN
606    NaN
607    NaN
608    NaN
609    NaN
610    NaN
611    NaN
612    NaN
613    NaN
Name: Married, Length: 614, dtype: object

**TODO 7**
Show columns `Id` and `Status` of the tenth, twelfth and thirteenth rows in the DataFrame.

In [ ]:
#####TODO 7#####
pass

**TODO 8** Find the highest monthly income of the debtors who are repaying their loans.

In [51]:
#####TODO 8#####
pass

TypeError: '>' not supported between instances of 'float' and 'str'

**TODO 9** 
Return the index of the row with the lowest loan balance.

In [ ]:
#####TODO 9#####
pass

**TODO 10** Find the number of rows with missing values.

In [8]:
#####TODO 10#####
pass
df.isnull().sum(axis=1)

NameError: name 'df' is not defined